tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "aws-iam-authenticator"
brew "awscli"
brew "bash"
brew "coreutils"
brew "curl"
brew "dive"
brew "docker", link: false
brew "docker-buildx", link: false
brew "docker-compose", link: false

#brew "ffmpeg"
#brew "gh"
brew "git"
brew "go" unless system "go version"
brew "groovy"
brew "helm"
brew "hyperfine"
brew "jq"
brew "just"
brew "skopeo"
#brew "kompose"
brew "kubernetes-cli", link: false
brew "midnight-commander"
brew "neovim"
brew "python@3.10"
brew "rsync"
#brew "ripgrep"
brew "tfenv"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"

cask "docker"


cask "tofu"

cask "gimp"

cask "iterm2"

cask "keepassxc"

# Clipboard manager
cask "maccy"

cask "firefox"
cask "google-chrome"

# Fonts
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"


cask "spotify"

cask "slack"
cask "telegram"
cask "zoom"
cask "signal"

#cask "microsoft-remote-desktop"
cask "visual-studio-code"
vscode "aaronyoung.dark-synthwave-vscode"
vscode "alefragnani.project-manager"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "qwtel.sqlite-viewer"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "robbowen.synthwave-vscode"
vscode "ryu1kn.partial-diff"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sleistner.vscode-fileutils"
vscode "timonwong.shellcheck"
vscode "tldraw-org.tldraw-vscode"
vscode "wholroyd.jinja"
vscode "yzhang.markdown-all-in-one"

cask "vlc"

cask "keycastr"
