tap "adoptopenjdk/openjdk"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "aws-iam-authenticator"
brew "awscli"
brew "coreutils"
brew "curl"
brew "dive"
brew "docker", link: false
brew "docker-buildx", link: false
brew "docker-compose", link: false

#brew "ffmpeg"
#brew "gh"
brew "git"
brew "openjdk"
brew "go" unless system "go version"
brew "groovy"
brew "helm"
brew "jq"
#brew "kompose"
brew "kubernetes-cli", link: false
brew "midnight-commander"
brew "neovim"
brew "python@3.10"
brew "rsync"
#brew "ripgrep"
brew "tfenv"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"

cask "docker"

cask "gimp"

cask "iterm2"

# Clipboard manager
cask "maccy"

cask "firefox"
cask "google-chrome"

# Fonts
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono-nerd-font"


cask "spotify"

cask "slack"
cask "telegram"
cask "zoom"
cask "signal"

cask "microsoft-remote-desktop"
cask "visual-studio-code"

cask "vlc"

cask "keycastr"
